In [1]:
import os
import pandas as pd
import numpy as np

#df = pd.read_excel('narrative_raw.xlsx')
df = pd.read_csv('raw.csv',index_col = False, dtype = {"CountyCode": str,"DistrictCode": str,"SchoolCode": str})
df.head(2)

,CountyCode,CountyName,DistrictCode,DistrictName,Teachers/Admins,Bachelors,Masters,Doctoral
0,01,ATLANTIC,0010,ABSECON CITY,Admin,NaN,50,50
1,01,ATLANTIC,0010,ABSECON CITY,Teachers,58,41,2

### Check number of columns and rows

In [2]:
df.shape

(1350, 8)

### Adding columns from 2016-17 table

In [3]:
df['HighestLevelOfEducation'] = 'NA'
df['HighestLevelEdPct'] = 'NA'
df['Year'] = '2017-18'

### Check if columns are added properly

In [6]:
df.head()

,CountyCode,CountyName,DistrictCode,DistrictName,Teachers/Admins,Bachelors,Masters,Doctoral,HighestLevelOfEducation,HighestLevelEdPct,Year
0,01,ATLANTIC,0010,ABSECON CITY,Admin,NaN,50,50,NA,NA,2017-18
1,01,ATLANTIC,0010,ABSECON CITY,Teachers,58,41,2,NA,NA,2017-18
2,01,ATLANTIC,0110,ATLANTIC CITY,Admin,NaN,94,6,NA,NA,2017-18
3,01,ATLANTIC,0110,ATLANTIC CITY,Teachers,57,41,1,NA,NA,2017-18
4,01,ATLANTIC,0120,ATLANTIC CO VOCATIONAL,Admin,NaN,78,22,NA,NA,2017-18

### Check missing values

In [7]:
df.isnull().sum()

CountyCode                   0
CountyName                   0
DistrictCode                 0
DistrictName                 0
Teachers/Admins              0
Bachelors                  675
Masters                      0
Doctoral                     0
HighestLevelOfEducation      0
HighestLevelEdPct            0
Year                         0
dtype: int64

### Fill missing values

In [8]:
df = df.fillna('9999999')

### Check again if missing values are dealt properly

In [9]:
df.isnull().sum()

CountyCode                 0
CountyName                 0
DistrictCode               0
DistrictName               0
Teachers/Admins            0
Bachelors                  0
Masters                    0
Doctoral                   0
HighestLevelOfEducation    0
HighestLevelEdPct          0
Year                       0
dtype: int64

### Check for meaningless values such as '**','N'

In [15]:
#df['School Requires Comprehensive Support - As of 2017-18'] = df['School Requires Comprehensive Support - As of 2017-18'].replace('**','NA')

df['Bachelors'] = df['Bachelors'].replace('N',9999999)
df['Masters'] = df['Masters'].replace('N',9999999)
df['Doctoral'] = df['Doctoral'].replace('N',9999999)
df['HighestLevelEdPct'] = df['HighestLevelEdPct'].replace('N',9999999)

df['Bachelors'] = df['Bachelors'].replace('NA',9999999)
df['Masters'] = df['Masters'].replace('NA',9999999)
df['Doctoral'] = df['Doctoral'].replace('NA',9999999)
df['HighestLevelEdPct'] = df['HighestLevelEdPct'].replace('NA',9999999)

### Check Data types of all columns

In [16]:
df.dtypes

CountyCode                  object
CountyName                  object
DistrictCode                object
DistrictName                object
Teachers/Admins             object
Bachelors                  float64
Masters                    float64
Doctoral                   float64
HighestLevelOfEducation     object
HighestLevelEdPct            int64
Year                        object
dtype: object

### Change Data types

In [17]:
df["Bachelors"] = df["Bachelors"].astype(float)
df["Masters"] = df["Masters"].astype(float)
df["Doctoral"] = df["Doctoral"].astype(float)
df["HighestLevelEdPct"] = df["HighestLevelEdPct"].astype(float)

### Check the changed data types

In [18]:
df.dtypes

CountyCode                  object
CountyName                  object
DistrictCode                object
DistrictName                object
Teachers/Admins             object
Bachelors                  float64
Masters                    float64
Doctoral                   float64
HighestLevelOfEducation     object
HighestLevelEdPct          float64
Year                        object
dtype: object

### Get a look at final data

In [19]:
df.head()

,CountyCode,CountyName,DistrictCode,DistrictName,Teachers/Admins,Bachelors,Masters,Doctoral,HighestLevelOfEducation,HighestLevelEdPct,Year
0,01,ATLANTIC,0010,ABSECON CITY,Admin,9999999.0,50.0,50.0,NA,9999999.0,2017-18
1,01,ATLANTIC,0010,ABSECON CITY,Teachers,58.0,41.0,2.0,NA,9999999.0,2017-18
2,01,ATLANTIC,0110,ATLANTIC CITY,Admin,9999999.0,94.0,6.0,NA,9999999.0,2017-18
3,01,ATLANTIC,0110,ATLANTIC CITY,Teachers,57.0,41.0,1.0,NA,9999999.0,2017-18
4,01,ATLANTIC,0120,ATLANTIC CO VOCATIONAL,Admin,9999999.0,78.0,22.0,NA,9999999.0,2017-18

In [20]:
#df1.to_csv(df1.csv)
df.to_csv('TeachersAdminsLevelOfEducation.csv', encoding='utf-8', index=False)

In [ ]:
#x= df1.to_excel('output1.xlsx')  # doctest: +SKIP